#+TITLE: Configure DNS servers with failover using BIND
#+SUBTITLE: -- 
#+AUTHOR: Zakaria.K 
#+EMAIL: 4.kebairia@gmail.com 
#+DATE: 04 Apr 2023 Tue 
#+KEYWORDS: blog,
#+OPTIONS: html5-fancy:t tex:t
#+begin_date
{{{date}}}
#+end_date

- I want to create a repeatable way to install and deploy my homelab, and all the nodes and services that I need to use day to day.

We will be setting up DNS failover using a Master/Slave configuration and configuring dynamic updates.
We have installed and configured two **RockyLinux9** servers (minimal version) with the following:

- The homelab subnet will be =10.10.0.0/24=
- MAC address on each VM is configured so that I can have a good control on my nodes, and also this will help me with the DHCP server to assign static IP addresses for these nodes
    - All MAC addresses will start with =00:2A:31:00:00:<IP>=
    - for example, my admin1.hl.test node with the IP 10.10.0.2 will have the following MAC address "00:2A:31:00:00:02"

| Name   | Hostname       | Role   | IP Address   | SELinux   |
|--------+----------------+--------+--------------+-----------|
| /      | <              | <      | <            | <         |
| admin1 | admin1.hl.test | Master | 10.10.0.2/24 | Enforcing |
| admin2 | admin2.hl.test | Slave  | 10.10.0.3/24 | Enforcing |

* Configure Clients
#+begin_src sh
$ sudo nmcli c mod enp1s0 ipv4.dns '10.10.0.2 10.10.0.3' ipv4.dns_search 'hl.test'
$ sudo nmcli c down enp1s0 ; sudo nmcli c up enp1s0
#+end_src
Let's check our =/etc/resolv.conf= file
#+begin_src sh :results none :exports results
sudo cat /etc/resolv.conf 
#+end_src

#+RESULTS:
: # Generated by NetworkManager
: search hl.test
: nameserver 10.10.0.2
: nameserver 10.10.0.3
